recept/src/AccumulationRegisters/СтадииВыполненияЗаказов/СтадииВыполненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтадииВыполненияЗаказов</name>
  <resources>
    <name>ВЗаявке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВПроизводстве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Готово</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/CommonForms/ФормаПодбораЗаявок/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем таблицу значений остатками при открытии формы
	ЗаполнитьТаблицуОстатков();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОстатков()
	
	Запрос = Новый Запрос;
	// Выбираем не более 100 записей
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ЛОЖЬ КАК Выбран,
		|	СтадииВыполненияЗаказовОстатки.Номенклатура КАК Номенклатура,
		|	СтадииВыполненияЗаказовОстатки.Характеристика КАК Характеристика,
		|	СтадииВыполненияЗаказовОстатки.ЗаказКлиента КАК ЗаказКлиента,
		|	СтадииВыполненияЗаказовОстатки.ВЗаявкеОстаток КАК ВЗаявкеОстаток
		|ИЗ
		|	РегистрНакопления.СтадииВыполненияЗаказов.Остатки( , ) КАК СтадииВыполненияЗаказовОстатки
    	|ГДЕ
    	|	СтадииВыполненияЗаказовОстатки.ВЗаявкеОстаток > 0";
	
	// Загружаем результат запроса напрямую в реквизит формы
	ТаблицаЗаявок.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
// Получаем уже свернутый массив структур с сервера
	СвернутыйМассив = ПолучитьСвернутыеДанныеНаСервере();
	
	Если СвернутыйМассив.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Пожалуйста, отметьте хотя бы одну строку!");
		Возврат;
	КонецЕсли;
	
	// Оповещаем форму-владельца, передавая готовый агрегированный массив
	ОповеститьОВыборе(СвернутыйМассив);

КонецПроцедуры

&НаСервере
Функция ПолучитьСвернутыеДанныеНаСервере()
	
	МассивРезультата = Новый Массив;
	
	// Выгружаем данные формы в серверную Таблицу Значений
	ТЗДанных = ТаблицаЗаявок.Выгрузить();
	
	// Оставляем только те строки, где установлен флажок
	Отбор = Новый Структура("Выбран", Истина);
	МассивВыбранныхСтрок = ТЗДанных.НайтиСтроки(Отбор);
	
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Возврат МассивРезультата;
	КонецЕсли;
	
	// Создаем временную таблицу для агрегации данных
	ТЗГруппировки = Новый ТаблицаЗначений;
	ТЗГруппировки.Колонки.Добавить("Номенклатура");
	ТЗГруппировки.Колонки.Добавить("Характеристика");
	// Явно указываем тип числа для корректной работы метода Свернуть()
	ТЗГруппировки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число")); 
	
	// Копируем выбранные данные в таблицу группировки
	Для Каждого СтрокаДанных Из МассивВыбранныхСтрок Цикл
		НоваяСтрока = ТЗГруппировки.Добавить();
		НоваяСтрока.Номенклатура   = СтрокаДанных.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаДанных.Характеристика;
		НоваяСтрока.Количество     = СтрокаДанных.ВЗаявкеОстаток;
	КонецЦикла;
	
	// Сворачиваем таблицу по уникальным связкам "Номенклатура + Характеристика", суммируя количество
	ТЗГруппировки.Свернуть("Номенклатура, Характеристика", "Количество");
	
	// Перегоняем результат обратно в массив структур для передачи на клиент
	Для Каждого СводнаяСтрока Из ТЗГруппировки Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Номенклатура",   СводнаяСтрока.Номенклатура);
		СтруктураСтроки.Вставить("Характеристика", СводнаяСтрока.Характеристика);
		СтруктураСтроки.Вставить("Количество",     СводнаяСтрока.Количество);
		
		МассивРезультата.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции
